Ganghyeok-Lim/Proj-STM32C011F6U6TR_SOM_Bd/Rev_A/02_FW/STM32C011F6U6TR_SOM_Bd/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32c0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MCU_STATUS_LED_Pin GPIO_PIN_15
#define MCU_STATUS_LED_GPIO_Port GPIOC
#define MCU_USART1_TX_Pin GPIO_PIN_0
#define MCU_USART1_TX_GPIO_Port GPIOA
#define MCU_SPI1_MOSI_Pin GPIO_PIN_2
#define MCU_SPI1_MOSI_GPIO_Port GPIOA
#define MCU_SPI1_SCK_Pin GPIO_PIN_5
#define MCU_SPI1_SCK_GPIO_Port GPIOA
#define MCU_SPI1_MISO_Pin GPIO_PIN_6
#define MCU_SPI1_MISO_GPIO_Port GPIOA
#define MCU_USART1_RX_Pin GPIO_PIN_8
#define MCU_USART1_RX_GPIO_Port GPIOA
#define MCU_SWD_SWDIO_Pin GPIO_PIN_13
#define MCU_SWD_SWDIO_GPIO_Port GPIOA
#define MCU_SWD_SWCLK_Pin GPIO_PIN_14
#define MCU_SWD_SWCLK_GPIO_Port GPIOA
#define MCU_I2C1_SCL_Pin GPIO_PIN_6
#define MCU_I2C1_SCL_GPIO_Port GPIOB
#define MCU_I2C1_SDA_Pin GPIO_PIN_7
#define MCU_I2C1_SDA_GPIO_Port GPIOB
#define EXT_12MHZ_CLK_Pin GPIO_PIN_14
#define EXT_12MHZ_CLK_GPIO_Port GPIOC

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
